app/Controllers/AuthController.php

    public function processLogin()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'aventurine@gmail.com'
 LIMIT 1

    public function processRegister()
    {
        $userModel = new \App\Models\UserModel();

        $data = [
            'username' => $this->request->getPost('username'),
            'email'    => $this->request->getPost('email'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT)
        ];

        $userModel->save($data);
---
INSERT INTO `users` (`username`, `email`, `password`) VALUES ('hikmah', '2310817120010@mhs.ulm.ac.id', '$2y$10$0bJ6/wdR735xqVRUzFwWEew/uaDCLMCnOU3GBWa5enEMZcDhuSb7i')