app/Controllers/DashboardController.php

SELECT *
FROM `categories`
SELECT *
FROM `tasks`
WHERE `user_id` = '2'
SELECT *
FROM `tasks`
WHERE `tasks`.`task_id` = '10'
---
    public function index()
    {
        $userId = session()->get('user_id');
        if (!$userId) {
            return redirect()->to('/login');
        }

        $categoryModel = new \App\Models\CategoryModel();
        $taskModel = new \App\Models\TaskModel();

        $categories = $categoryModel->findAll();
        $tasks = $taskModel->where('user_id', $userId)->findAll();

        $taskEdit = null;
        $editId = $this->request->getGet('edit');

        if ($editId && is_numeric($editId)) {
            $task = $taskModel->find($editId);