app/Controllers/TaskController.php

INSERT INTO `tasks` (`user_id`, `category_id`, `title`, `description`, `deadline`, `status`) VALUES ('2', '7', 'mendengarkan arctic monkeys', 'iyah lagunya bagus', '2025-08-19', 'pending')
---
    public function store()
    {
        $userId = session()->get('user_id');
        $this->taskModel->save([
            'user_id'     => $userId,
            'category_id' => $this->request->getPost('category_id'),
            'title'       => $this->request->getPost('title'),
            'description' => $this->request->getPost('description'),
            'deadline'    => $this->request->getPost('deadline'),
            'status'      => 'pending'
        ]);

SELECT *
FROM `tasks`
WHERE `task_id` = '10'
AND `user_id` = '2'
 LIMIT 1
UPDATE `tasks` SET `category_id` = '7', `title` = 'mendengarkan arctic monkeys', `description` = 'iyah lagunya bagussss', `deadline` = '2025-08-19', `status` = 'pending'
WHERE `tasks`.`task_id` IN ('10')
---
    public function update($id)
    {
        $userId = session()->get('user_id');

        $task = $this->taskModel
            ->where('task_id', $id)
            ->where('user_id', $userId)
            ->first();

        if (!$task) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("Task not found or you don't have permission.");
        }

        $this->taskModel->update($id, [
            'category_id' => $this->request->getPost('category_id'),
            'title'       => $this->request->getPost('title'),
            'description' => $this->request->getPost('description'),
            'deadline'    => $this->request->getPost('deadline'),
            'status'      => $this->request->getPost('status')
        ]);

DELETE FROM `tasks`
WHERE `task_id` IN ('3')
---
    public function delete($id)
    {
        $this->taskModel->delete($id);